## Handling missing values

Missing data in the dataset occures when some og the information is not stored for variable.

### There are 3 mechanisms:-

### MCAR (Missing Completely At Random)

The probability of a value being missing does not depend on the data (neither on observed values nor on the missing ones).

In other words, the missingness is completely random.

Example: Suppose during data entry, a clerk randomly forgets to fill in a few ages in a survey. The missingness has nothing to do with age or any other variableâ€”itâ€™s just random.

### MAR (Missing At Random):-

The probability of a value being missing depends on other observed variables, but not on the missing variable itself.

Example:

In a medical dataset, suppose income is missing more often for older people.

Here, the missingness of income depends on the observed variable age, not on income itself.

ðŸ‘‰ In MAR, the missingness is systematic but explainable using other features.

You can often handle MAR by using imputation methods like:

Mean/median imputation within groups (e.g., by age category).

Regression imputation (predict missing values using other features).

More advanced methods like Multiple Imputation by Chained Equations (MICE).

### MNAR (Missing Not At Random):-

The probability of missingness depends on the missing value itself, even after considering other features.

Example:

In a survey, people with very high incomes might choose not to report their income.

Here, the missingness is directly related to the value of the income itself.

ðŸ‘‰ This is the hardest type to deal with, because:

The missing data is not random.

Standard imputation methods (like mean or regression) can introduce bias.

Ways to handle MNAR:

Model the missingness explicitly (create an indicator feature: is_income_missing).

Domain knowledge â€” sometimes you must consult experts to understand why the data is missing.

Advanced statistical methods like Heckman correction or sensitivity analysis.

In [3]:
import numpy as np
import seaborn as sns

In [4]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Information about the dataset:

In [5]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### Checking missing values:

In [6]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### To handle missing values, we can delet that rows or columns. but its not proper way. you will loose huge amount of data.

In [8]:
df.shape

(891, 15)

In [10]:
df.dropna().shape   #after dropping missing value rows, very less amount of data is remain.

(182, 15)

### Columnwise deletion of missing values:

In [11]:
df.dropna(axis=1)

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,man,True,no,True
887,1,1,female,0,0,30.0000,First,woman,False,yes,True
888,0,3,female,1,2,23.4500,Third,woman,False,no,False
889,1,1,male,0,0,30.0000,First,man,True,yes,True
890,0,3,male,0,0,7.7500,Third,man,True,no,True

#### From above we can say that age and deckk column has gone.